# Murder Mistery LAB

In [8]:
import sqlite3 
import pandas as pd

### LECTURA DE LA BASE DE DATOS

In [9]:
conn = sqlite3.connect('sql-murder-mystery.db')

### BUSQUEDA DEL REPORTE EN LA FECHA QUE SE REALIZO

In [53]:
REPORTE = """
SELECT *
FROM crime_scene_report
WHERE date = '20180115'
AND city = 'SQL City'
AND type = 'murder'

"""

In [54]:
res1 = pd.read_sql(REPORTE ,conn)
res1

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

### BUSQUEDA DE LOS 2 TESTIGOS, EL QUE VIVE EN NORTHWESTERN Y LA QUE SE LLAMA ANNABEL

In [55]:
TESTIGOS = """
SELECT id, name, address_street_name, MAX(address_number) address_number
FROM person
WHERE address_street_name = 'Northwestern Dr'
UNION
SELECT id, name, address_street_name, address_number
FROM person
WHERE address_street_name = 'Franklin Ave'
AND name LIKE '%Annabel%'

"""

In [56]:
res2 = pd.read_sql(TESTIGOS ,conn)
res2

      id            name address_street_name  address_number
0  14887  Morty Schapiro     Northwestern Dr            4919
1  16371  Annabel Miller        Franklin Ave             103

### BUSCAMOS LA ENTREVISTA DE LOS TESTIGOS SEGUN SU ID

In [57]:
ENTREVISTAT = """
SELECT *
FROM interview
WHERE person_id IN (14887, 16371)
"""

In [58]:
res3 = pd.read_sql(ENTREVISTAT, conn)
res3

   person_id                                         transcript
0      14887  I heard a gunshot and then saw a man run out. ...
1      16371  I saw the murder happen, and I recognized the ...

### BUSQUEDA SEGUN LO PROPORCIONADO DEL GIMANSIO Y DEL CARRO

In [44]:
DESCRIPCIONA = """
SELECT *
FROM get_fit_now_member A
INNER JOIN get_fit_now_check_in B ON A.id = B.membership_id
INNER JOIN person C ON C.id = A.person_id
INNER JOIN drivers_license D ON D.id = C.license_id
WHERE B.check_in_date = '20180109'
AND A.membership_status = 'gold'
AND A.id LIKE '48Z%'
AND D.gender = 'male'
AND D.plate_number LIKE '%H42W%'
"""

In [45]:
res4 = pd.read_sql(DESCRIPCIONA, conn)
res4

,id,person_id,name,membership_start_date,membership_status,membership_id,check_in_date,check_in_time,check_out_time,id,...,ssn,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,48Z55,67318,Jeremy Bowers,20160101,gold,48Z55,20180109,1530,1700,67318,...,871539279,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS

### SEGUN LO DE LOS TESTIGOS VERIFICAMOS QUE ESTE CORRECTO

In [28]:
solution1 = """
INSERT INTO solution VALUES (1, 'Jeremy Bowers');
"""       
solution1_1 = """
    SELECT value FROM solution;
""" 
resS = pd.read_sql(solution1_1, conn)
resS

                                               value
0  Congrats, you found the brains behind the murd...

### PARA ENCONTRAR A LA MENTE DETRAS DEL ASESINATO, VEMOS LA ENTREVISTA DEL ASESINO

In [30]:
ENTREVISTAAA = """
SELECT *
FROM interview
WHERE person_id = 67318
"""

resI = pd.read_sql(ENTREVISTAAA, conn)
resI

   person_id                                         transcript
0      67318  I was hired by a woman with a lot of money. I ...

### SEGUN LO DICHO POR EL ASESINO BUSCAMOS A LA SEÑORA CON DINERO Y QUE VA AL EVENTO

In [51]:
solucionF = """
SELECT A.id, A.name, C.annual_income, D.event_name, D.date, B.*
FROM person A
INNER JOIN drivers_license B ON B.id = A.license_id
INNER JOIN income C ON C.ssn = A.ssn
INNER JOIN facebook_event_checkin D ON D.person_id = A.id
WHERE B.gender = 'female'
AND B.car_make = 'Tesla'
AND B.car_model = 'Model S'
AND B.height >= 65
AND B.height <= 67
AND B.hair_color = 'red'
"""

resF = pd.read_sql(solucionF, conn)
resF

,id,name,annual_income,event_name,date,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,99716,Miranda Priestly,310000,SQL Symphony Concert,20171206,202298,68,66,green,red,female,500123,Tesla,Model S
1,99716,Miranda Priestly,310000,SQL Symphony Concert,20171212,202298,68,66,green,red,female,500123,Tesla,Model S
2,99716,Miranda Priestly,310000,SQL Symphony Concert,20171229,202298,68,66,green,red,female,500123,Tesla,Model S

### VERIFICAMOS SI ES LA MENTE DETRAS DEL ASESINATO

In [32]:
solution2 = """
INSERT INTO solution VALUES (1, 'Miranda Priestly');
"""       
solution2_1 = """
    SELECT value FROM solution;
""" 
resS = pd.read_sql(solution2_1, conn)
resS

                                               value
0  Congrats, you found the brains behind the murd...